---
kind: method
id: M:Autodesk.Revit.DB.OBJExportOptions.#ctor
source: html/43ae0d7b-847e-80b9-0350-b495fcf3b30b.htm
---
# Autodesk.Revit.DB.OBJExportOptions.#ctor Method

Constructs a new instance of OBJExportOptions with default values of all properties.

## Syntax (C#)
```csharp
public OBJExportOptions()
```